ZefanLin159/ESP32S3-HUB75E/sdkconfig.defaults
# Pixel Music Companion - default SDK configuration for ESP32-S3
# ESP-IDF v5.1.2 target defaults

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# CPU / performance
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# FatFS (long file names for SD card music files)
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_MAX_LFN=255



# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
